################################################################# ---
##             고등학교 실용통계 : 차량 중량과 연비            ##
##                    개발자: 이광춘                           ##
##                최종수정일: 2022-05-24                       ##
################################################################# ---

# 1. 패키지 -------------
library(tidyverse)
library(readxl)
library(usethis)

# 2. 데이터 전처리 -------------

rawData <- readxl::read_excel("inst/extdata/p_078_차량_중량과연비.xlsx") %>%
  janitor::clean_names(ascii = FALSE) %>%
  janitor::remove_empty("rows") %>%
  select(!starts_with("x"))

# datapasta::dpasta(rawData)



# 3. 데이터 -------------

cars <- tibble::tribble(
  ~중량,    ~연비,
  "1795", "13.8",
  "1550", "11.2",
  "1235", "15.2",
  "1460",   "13",
  "1820", "13.1",
  "2015",  "8.7",
  "1220", "13.7",
  "1595", "10.7",
  "1450", "12.3",
  "1565",   "15",
  "1325",   "13",
  "890",   "16",
  "1270", "11.8",
  "1640", "14.3",
  "1510", "10.7",
  "2165", "11.3",
  "1555", "11.2",
  "1320", "12.8",
  "1650", "10.4",
  "1405", "12.3",
  "1285", "13.1",
  "1550",   "15",
  "1645", "12.8",
  "1990",   "11",
  "1400", "12.7",
  "900", "15.2",
  "1030",   "13",
  "1250", "13.5",
  "1720",  "9.6",
  "1290", "11.3"
)


cars <- cars %>%
  mutate(across(everything(), as.integer))

# 4. 내보내기 ---------------------

cars <- krvote::clean_varnames(cars)

write_csv(cars, "data-raw/cars.csv")

# 5. 문서화 -----------------------

sinew::makeOxygen(cars)

usethis::use_data(cars, overwrite = TRUE, compress = 'xz')

